Revit 2024 API
WireframeBuilder.AddPoint Method
 Add a point to the shape representation stored in this WireframeBuilder.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public void AddPoint(
	Point GPoint
)
Visual Basic
Public Sub AddPoint ( _
	GPoint As Point _
)
Visual C++
public:
void AddPoint(
	Point^ GPoint
)
Parameters
GPoint
Type: Autodesk.Revit.DB.Point
 The point to be added.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  GPoint is not acceptable for a wireframe shape representation.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
WireframeBuilder Class
Autodesk.Revit.DB Namespace